Revit 2027 API
BuiltInFailures.WallFailures.WallNegativeHeight Property
 The top of the Wall is lower than the base of the Wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId WallNegativeHeight { get; }
Public Shared ReadOnly Property WallNegativeHeight As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ WallNegativeHeight {
	FailureDefinitionId^ get ();
}
static member WallNegativeHeight : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace